// @flow
import React, {Component} from "react"; 
import Header from '../../library/header';
import Footer from  "../../library/footer"; 


// Images

// Style sheet
import './style.scss';
import Utils from "../../../utils/utilityScript";

type Props = {};

let _objForm = null;
class Instruction  extends Component<Props> {
 	constructor(props: Object) {
		super(props);
		this.state = { 		 
        }	 
		this.navigateTo = Utils.navigateTo.bind(this);
    }

	componentWillUnmount() {
	 
	}

	componentWillMount(){
		 
	}

	componentDidUpdate(prevProps, prevState) {
	}
	refresh(){
	 
	}
    inputTextChangeHandler(type, event){
	 
	}
 	async handleFormSubmit()
	{
          
     }
  
 render() {	 
 
		return (
			<div className="home-wrapper">
				 <Header baseTheme={'#f18eb1'} backToHome={()=>this.navigateTo('/home')}/>
                 <div className="main-title">
                         <div className="row">
                                <div className="flash_title">
                                                 <marquee><span className="marqueeClass">18 നും 40 വയസ്സിനും  മദ്ധ്യേ പ്രായമുള്ള യുവജനങ്ങള്‍ക്കാണ്  മത്സരത്തില്‍ പങ്കടുക്കുവാന്‍ അവസരം ലഭിക്കുന്നത്. സ്യഷ്ടികളുടെ ദൈര്‍ഘ്യം : ചുരുങ്ങിയത് 1 മിനിട്ടും പരമാവധി 5 മിനിട്ടും.  2021 ഒക്ടോബര്‍ 31 വരെയാണ്  അപേക്ഷ സ്വീകരിക്കുന്നത്.</span></marquee>
                                </div>                         
                        </div>					 	 
						<div className="row form-coloumn">
							<div className="col-md-3"></div>   
							<div className="col-md-6 instn">        
								<div className="form-wrapper"> 
										<div className="instruction-header">
										<h2>REELS - 2021</h2>
										<h3>ഓണ്‍ലൈന്‍ ഷോര്‍ട്ട് ഫിലിം ഫെസ്റ്റിവല്‍</h3>
										<h3>18 നും 40 വയസ്സിനും മദ്ധ്യേ പ്രായമുള്ള യുവജനങ്ങള്‍ക്കാണ് മത്സരത്തില്‍ പങ്കെടുക്കുവാന്‍ അവസരം ലഭിക്കുന്നത്.
സൃഷ്ടികളുടെ ദൈര്‍ഘ്യം ചുരുങ്ങിയത് 1 മിനിട്ടും പരമാവധി 5 മിനിട്ടും.
ഒക്ടോബര്‍  31 വരെയാണ് അപേക്ഷ സ്വീകരിക്കുന്നത്.</h3>
</div>
							        	<h3 className="instruction"> നിയമാവലി</h3>

										<ol className="instruction-texts">
										  <li>1. a)  സ്വാതന്ത്ര്യം b) ഭയം c) പ്രതീക്ഷ  എന്നിങ്ങനെ  3 വിഭാഗങ്ങളായാണ് മത്സരം
സംഘടിപ്പിക്കുന്നത്.</li>
										 
										  <li>വീഡിയോകള്‍ (Fiction or Non-fiction) ആകാവുന്നതാണ്. </li>
										 
										  <li>ചുരുങ്ങിയത് 1 മിനിറ്റും പരമാവധി 5 മിനിറ്റും ദൈര്‍ഘ്യമുള്ള വീഡിയോകള്‍ മാത്രമേ മത്സരത്തിന് പരിഗണിക്കൂ. </li>
										  
										  <li>വീഡിയോകള്‍ 2021 ഒക്ടോബര്‍ 31 നു മുമ്പായി വീഡിയോ ഫോര്‍മാറ്റില്‍ അപ്ലോഡ് ചെയ്യേണ്ടതാണ്. </li>
										  
										  <li>യുവജനക്ഷേമ ബോര്‍ഡ് രൂപീകരിക്കുന്ന ജൂറിയാണ് മത്സരത്തിലെ വിജയികളെ തീരുമാനിക്കുന്നത്.</li>
										  
										  <li>തെരഞ്ഞെടുക്കപ്പെടുന്ന വീഡിയോകളുടെ പ്രദര്‍ശനം തുടങ്ങി മത്സരവിജയികളെ തെരഞ്ഞെടുക്കുന്നതുമായി ബന്ധപ്പെട്ട
എല്ലാ കാര്യങ്ങളും ജൂറിയുടെ അധികാരപരിധിയില്‍ വരുന്നതാണ്. ഫൈനല്‍ സ്ക്രീനിംഗിന് തെരഞ്ഞെടുക്കപ്പെടുന്ന ചിത്രങ്ങളുടെ സംവിധായകര്‍ക്ക് (ഒരാള്‍ക്ക്) റ്റി.എ ഇനത്തില്‍ 3rd AC ട്രെയിന്‍ ഫെയര്‍ നല്‍കുന്നതാണ്. </li>
										  
										  <li>യുവജനക്ഷേമ ബോര്‍ഡ് മെമ്പര്‍ സെക്രട്ടറി, ഷോട്ട്ഫിലിം ഫെസ്റ്റിവലിന്‍റെ ഡയറക്ടറായി പ്രവര്‍ത്തിക്കും. </li>
										  
										  <li>ഡയറക്ടര്‍ക്ക് ഫെസ്റ്റിവലിന്‍റെ നിയമാവലിയുമായി ബന്ധപ്പെട്ട് ഏത് തീരുമാനത്തിലും മാറ്റങ്ങള്‍ വരുത്താന്‍ അധികാരം ഉണ്ടായിരിക്കും. </li>
										 
										  <li>മത്സരത്തിലേക്ക് അയക്കുന്ന വീഡിയോകള്‍ പിന്‍വലിക്കാന്‍ കഴിയുന്നതല്ല. </li>
										 
										  <li>മത്സരത്തിന് നല്‍കുന്ന ഷോര്‍ട്ട് ഫിലിമുകള്‍ 2020 ജനുവരി 1 നു ശേഷം നിര്‍മ്മിച്ചവയായിരിക്കണം. ഇതു സംബന്ധിച്ച സത്യവാങ്മൂലം ഡയറക്ടര്‍ ഓണ്‍ലൈനായി അപ് ലോഡ് ചെയ്യേണ്ടതാണ്.</li>
										 
										  <li>അഭിനയം, സംവിധാനം തുടങ്ങി  പുതിയ അവാര്‍ഡുകള്‍ പ്രഖ്യാപിക്കാനുള്ള അവകാശം ജൂറിക്കായിരിക്കും. ഇതിന് ക്യാഷ് പ്രൈസ് ഉണ്ടായിരിക്കുന്നതല്ല. </li>
										
										  <li>മലയാളത്തില്‍ അല്ലാത്ത സംഭാഷണങ്ങള്‍ക്ക് ഇംഗ്ലീഷ് സബ്ടൈറ്റില്‍ ഉണ്ടായിരിക്കണം. </li>
										 
										  <li>വീഡിയോയോടൊപ്പം സൃഷ്ടിയെ സംബന്ധിച്ച ലഘുവിവരണം മലയാളത്തിലോ ഇംഗ്ലീഷിലോ തയ്യാറാക്കി അപ്ലോഡ് ചെയ്യേണ്ടതാണ്. </li>
										 
										  <li> ഡയറക്ടറുടെ പേര്, വിലാസം, മൊബൈല്‍ ഫോണ്‍ നമ്പര്‍, ഇമെയില്‍ വിലാസം, വയസ്സു തെളിയിക്കുന്ന രേഖ, ഡയറക്ടറുടെ ഫോട്ടോ, ഫിലിമിന്‍റെ സ്റ്റില്‍ ഫോട്ടോകള്‍ തുടങ്ങിയവ വീഡിയോയോടൊപ്പം അനുബന്ധമായി കൂട്ടിച്ചേര്‍ക്കണം.
</li>
										 
										  <li>2021 ജനുവരി  1 ന് 40 വയസ്സു കഴിയുന്നവരുടെ എന്‍ട്രികള്‍ സ്വീകരിക്കുന്നതല്ല. </li>
										
										  <li> <b>സമ്മാനഘടന</b>
										  <ol type="a">
											<li><b>വിഭാഗം  a (സ്വാതന്ത്ര്യം) : </b> : ഒന്നാം സമ്മാനം -50,000/-രൂപ, രണ്ടാം സമ്മാനം-25,000 രൂപ, മൂന്നാം സമ്മാനം-15,000 രൂപ</li>
											   
											<li><b>വിഭാഗം b (ഭയം)  </b> :ഒന്നാം സമ്മാനം - 50,000/- രൂപ, രണ്ടാം സമ്മാനം - 25,000 രൂപ, മൂന്നാം സമ്മാനം - 15,000 രൂപ</li>
											   
											<li><b>വിഭാഗം c (പ്രതീക്ഷ) </b> :ഒന്നാം സമ്മാനം - 50,000/- രൂപ, രണ്ടാം സമ്മാനം - 25,000 രൂപ, മൂന്നാം സമ്മാനം - 15,000 രൂപ</li>
										  </ol>																			  
										  </li>
										 
										  <li> നിലവാരക്കുറവോ, എന്‍ട്രികള്‍ മതിയായ രൂപത്തില്‍ ലഭിക്കാത്തതോ തുടങ്ങി ജൂറിക്ക് ബോധ്യപ്പെടുന്ന കാരണങ്ങളുടെ മേല്‍ ഏത് സമ്മാനവും ഒഴിവാക്കാന്‍ ജൂറിക്ക് അവകാശം ഉണ്ടായിരിക്കും.</li>
										  
										  <li>  3 മേഖലകളിലും ഒന്നും രണ്ടും മൂന്നും സമ്മാനങ്ങള്‍ നല്‍കും. ഇതിലേതെങ്കിലും സമ്മാനങ്ങള്‍ ഒഴിവാക്കേണ്ടതുണ്ടെങ്കില്‍ അത് ഒഴിവാക്കുവാന്‍ ജൂറിക്ക് അധികാരമുണ്ടായിരിക്കും.</li>
	 
										</ol> 

											 <a >
												<button type="submit"  className="sub-button"  onClick={() => this.navigateTo('registration')}>തുടരുക</button>
											</a>  
										 
										 
								</div>
							</div>
							<div className="col-md-3"></div>   
						</div>
					</div> 

			</div>
		)
	}
}

export default Instruction;